<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML lang=zh><HEAD><TITLE>RGSS Specifications</TITLE>
<META content="text/html; charset=ISO-8859-1" http-equiv=Content-Type>
<META content=text/css http-equiv=Content-Style-Type><LINK rel=stylesheet
type=text/css href="../style.css">
<META name=GENERATOR content="MSHTML 8.00.7601.17744"></HEAD>
<BODY>
<H1><FONT face=Verdana>RGSS &#35268;&#26684;</FONT></H1>
<UL>
  <LI><A href="#whats_new">RGSS3 &#30340;&#26032;&#21151;&#33021;</A>
  <LI><A href="#game_run">&#24320;&#22987;&#28216;&#25103;</A>
  <LI><A href="#game_ini">Game.ini</A>
  <LI><A href="#rgss_rtp">RGSS-RTP</A>
  <UL>
    <LI><A href="#rgss_rtp_install">&#23433;&#35013;&#25968;&#25454;</A> </LI></UL>
  <LI><A href="#encryption_archive">&#21152;&#23494;&#26723;&#26696;</A>
  <LI><A href="#others">&#20854;&#20182;</A>
  <UL>
    <LI><A href="#ext_lib">&#25193;&#23637;&#24211;</A>
    <LI><A href="#character_code">&#23383;&#31526;&#38598;</A>
    <LI><A href="#property">&#23646;&#24615;</A> </LI></UL></LI></UL>
<H2><A name=whats_new>RGSS3</A>&nbsp;&#26032;&#21151;&#33021;&#20171;&#32461; <FONT face=Verdana><SPAN
class=rgss3>(RGSS3)</SPAN> </FONT></H2>
<P>RGSS3 &#26159;&#20869;&#32622;&#20110;&nbsp;RPG Maker VX Ace &#30340;&#19968;&#22871;&#33050;&#26412;&#31995;&#32479;&#65292; &#21644; RMVX &#20013;&#30340; RGSS2
&#27604;&#36215;&#26469;&#26377;&#24456;&#22810;&#30340;&#19981;&#21516;&#20043;&#22788;&#65292;&#20027;&#35201;&#30340;&#21464;&#21270;&#22914;&#19979;&#65306;</P>
<UL>
  <LI>&#31243;&#24207;&#24314;&#31435;&#22312;&nbsp;Ruby 1.9.2 &#30340;&#22522;&#30784;&#20043;&#19978;&#12290;&nbsp;Ruby
  1.9&nbsp;&#27604;&#36215;&#19978;&#19968;&#20010;&#29256;&#26412;&#26377;&#20102;&#24456;&#22823;&#30340;&#36827;&#27493;&#65292;&#36816;&#34892;&#25928;&#29575;&#26377;&#20102;&#26174;&#33879;&#30340;&#25552;&#39640;&#12290;
  <LI>&#24050;&#32463;&#38598;&#25104;&#20102;&#26085;&#25991;&#21644;&#33521;&#25991;&#30340;DLL&#25903;&#25345;&#24211;&#65288;&#24403;&#28982;&#65292;&#20013;&#25991;&#25903;&#25345;&#24211;&#26159;&#20027;&#31243;&#24207;&#27721;&#21270;&#32773;&#21518;&#26469;&#28155;&#21152;&#30340;&#65289;&#65292;&#28216;&#25103;&#30340;&#31383;&#20307;&#23436;&#20840;&#25903;&#25345;&#26085;&#25991;&#29615;&#22659;&#21644;&#33521;&#25991;&#29615;&#22659;&#12290;
  <LI>&#23545;&#21152;&#23494;&#26723;&#26696;&#30340;&#31639;&#27861;&#20570;&#20986;&#20102;&#25913;&#36827;&#65292;&#26377;&#25928;&#22320;&#25913;&#21892;&#20102;&#22823;&#22411;&#28216;&#25103;&#21551;&#21160;&#26102;&#38388;&#28459;&#38271;&#30340;&#24330;&#30149;&#12290;
  <LI>&#20351;&#29992;F12&#25353;&#38062;&#21487;&#20197;&#23545;&#28216;&#25103;&#36827;&#34892;&#22797;&#20301;&#25805;&#20316;&#65288;&#20351;&#29992;&#20102; <A href="g_functions.html#rgss_main">rgss_main</A>
  &#21151;&#33021;&#65289;&#12290;</A>
  <LI>&#21487;&#20197;&#23545;&#31383;&#21475;&#26694;&#26550;&#36827;&#34892;&#20462;&#25913;&#25805;&#20316;&#20102;&#65288;&#20351;&#29992; <A href="gc_window.html">Window</A>&nbsp;&#31867;&#65289;&#12290;
  <LI>&#36755;&#20986;&#25991;&#26412;&#30340;&#25551;&#32472;&#20801;&#35768;&#20351;&#29992; <A href="gc_font.html">Font</A> &#31867;&#30340;&#26041;&#27861;&#20102;&#12290;
  <LI>&#20801;&#35768;&#36890;&#36807;&#32534;&#36753;&#22120;&#36873;&#39033;&#36873;&#25321;&#26159;&#21542;&#22312;&#27979;&#35797;&#28216;&#25103;&#26102;&#24320;&#21551; DEBUG &#25511;&#21046;&#21488;&#65292;&#20197;&#36827;&#34892;&#26356;&#28145;&#23618;&#27425;&#30340;&#28216;&#25103;&#35843;&#35797;&#12290;
  <LI>p &#20989;&#25968;&#21487;&#20197;&#36755;&#20986;&#20026;&#23545;&#35805;&#26694;&#30340;&#21151;&#33021;&#24050;&#32463;&#34987;&#24223;&#38500;&#65292;&#21462;&#32780;&#20195;&#20043;&#30340;&#26159; <A
  href="g_functions.html#msgbox">msgbox</A>&nbsp;&#21644; <A
  href="g_functions.html#msgbox_p">msgbox_p</A>&nbsp;&#20004;&#20010;&#20989;&#25968;&#12290;
  <LI>&#25903;&#25345;Ogg&#26684;&#24335;&#30340;&#35270;&#39057;&#25773;&#25918;&#21151;&#33021;&#65292;&#20351;&#29992; <A
  href="gm_graphics.html#play_movie">Graphics.play_movie</A> &#26041;&#27861;&#21363;&#21487;&#12290;
  <LI>&#20801;&#35768;Ogg&#26684;&#24335;&#20197;&#21450;Wav&#26684;&#24335;&#30340;&#38899;&#39057;&#25991;&#20214;&#20174;&#20013;&#38388;&#24320;&#22987;&#25773;&#25918;&#65288;&#20351;&#29992; <A
  href="gm_audio.html">Audio</A>&nbsp;&#27169;&#22359;&#20013;&#30340;&#30456;&#20851;&#26041;&#27861;&#65289;&#12290;
  <LI>&#20801;&#35768;&#20351;&#29992;&#31526;&#21495;&#26469;&#23450;&#20041;&#25353;&#38062;&#21517;&#31216;&#65288;&#20351;&#29992; <A href="gm_input.html">Input</A> &#27169;&#22359;&#65289;&#65292;&#32780;&#30701;&#31526;&#21495;&#20063;&#23558;&#34987;&#20801;&#35768;&#20351;&#29992;&#65292;&#27604;&#22914;
  Input.trigger?(:C)&#12290;
  <LI>&#24403;&#31243;&#24207;&#21457;&#29983;&#38169;&#35823;&#30340;&#26102;&#20505;&#65292;&#23558;&#20250;&#33258;&#21160;&#26174;&#31034;&#19968;&#20010;&#25552;&#31034;&#26694;&#20197;&#35814;&#32454;&#35828;&#26126;&#38169;&#35823;&#20449;&#24687;&#12290; </LI></UL>
<P>&#38500;&#27492;&#20043;&#22806;&#65292;&#36824;&#26377;&#19968;&#20123;&#23567;&#21464;&#21270;&#30041;&#24453;&#29992;&#25143;&#33258;&#34892;&#25506;&#32034;&#12290;</P>
<P>&#22312;&#26412;&#25991;&#20013;&#65292;&#25152;&#26377;&#22312;RGSS3&#20013;&#37325;&#26032;&#23450;&#20041;&#30340;&#37096;&#20998;&#37117;&#20250;&#29992;&#27492;&#31526;&#21495;&#36827;&#34892;&#26631;&#27880;&#65306;&nbsp;<FONT face=Verdana><SPAN
class=rgss3>(RGSS3)&nbsp; </FONT><FONT color=#000000>&#12290;</FONT></SPAN></P>
<H2>&#24320;&#22987;&#28216;&#25103;</H2><IMG class=float_r alt="game folder" src="img/folder.png">
<P>&#19968;&#33324;&#30340;&#65292;&#24403;&#20320;&#21452;&#20987;Game.exe&#25991;&#20214;&#30340;&#26102;&#20505;&#65292;&#31243;&#24207;&#23601;&#20250;&#33258;&#21160;&#24320;&#22987;&#21152;&#36733;RGSS3&#36816;&#34892;&#24211;&#20197;&#25903;&#25345;&#28216;&#25103;&#31243;&#24207;&#30340;&#36816;&#34892;&#65292;&#32780;&#23384;&#20648;&#36825;&#20123;&#25991;&#20214;&#30340;&#25991;&#20214;&#22841;&#65292;&#36890;&#24120;&#23601;&#34987;&#31216;&#20026;&#28216;&#25103;&#30446;&#24405;&#12290;</P>
<P>&#27491;&#22312;&#32534;&#36753;&#20013;&#30340;&#28216;&#25103;&#21487;&#20197;&#36890;&#36807;&#22312;&#33756;&#21333;&#20013;&#36873;&#25321;&#28216;&#25103;&#24615;&#27979;&#35797;&#25110;&#32773;&#22312;&#25968;&#25454;&#24211; - &#25932;&#32676;&#20013;&#36873;&#25321;&#25112;&#26007;&#27979;&#35797;&#12290; &#22914;&#26524;&#20320;&#36873;&#25321;&#20102;&#28216;&#25103;&#24615;&#27979;&#35797;&#65292;&#37027;&#20040;&#21464;&#37327; $TEST
&#30340;&#20540;&#23558;&#20250;&#34987;&#26242;&#26102;&#35774;&#23450;&#20026;&#30495;&#65292;&#32780;&#22914;&#26524;&#20320;&#36873;&#25321;&#20102;&#25112;&#26007;&#27979;&#35797;&#65292;&#21017;&#26159;&#21464;&#37327; $BTEST &#30340;&#20540;&#23558;&#20250;&#34987;&#26242;&#26102;&#35774;&#23450;&#20026;&#30495;&#12290;</P>
<P>&#28216;&#25103;&#20854;&#20182;&#30340;&#19968;&#20123;&#35774;&#23450;&#21017;&#23384;&#20648;&#20110;&nbsp;<A href="#game_ini">Game.ini</A>&nbsp;&#36825;&#20010;&#37197;&#32622;&#25991;&#20214;&#24403;&#20013;&#12290;</P>
<H2><A name=game_ini>Game.ini</A></H2>
<P>Game.ini &#26159;&#22312;&#24037;&#31243;&#24314;&#31435;&#20043;&#21021;&#23601;&#34987;&#33258;&#21160;&#21019;&#24314;&#30340;&#65292;&#24182;&#19988;&#21487;&#20197;&#30001;&#36719;&#20214;&#26412;&#36523;&#36827;&#34892;&#26356;&#26032;&#25805;&#20316;&#65292;&#20294;&#26159;&#23427;&#20063;&#21487;&#20197;&#34987;&#35760;&#20107;&#26412;&#20197;&#21450;&#20854;&#20182;&#25991;&#23383;&#32534;&#36753;&#36719;&#20214;&#32534;&#36753;&#12290;</P>
<P>&#33539;&#20363;&#65306;</P><PRE><FONT face=Verdana>[Game]
RTP=RPGVXAce
Library=System\RGSS300.dll
Scripts=Data\Scripts.rvdata2
Title=RubyQuest
</FONT></PRE>
<DL>
  <DT>
  <DT>RTP
  <DD>
  <P>&nbsp;&#36825;&#26159;&#22312;&#36825;&#20010;&#28216;&#25103;&#20013;&#20351;&#29992;&#30340;&nbsp;<A href="#rgss_rtp">RGSS-RTP</A> &#21517;&#31216;&#65292;&#36890;&#24120;&#26159;
  "RPGVXAce"&#12290;</P>
  <P>&nbsp;&#22914;&#26524;&#36825;&#20010;RTP&#27169;&#32452;&#27809;&#26377;&#34987;&#23433;&#35013;&#65292;&#37027;&#20040;&#28216;&#25103;&#31243;&#24207;&#23601;&#20250;&#25253;&#38169;&#12290;</P>
  <DT>Library
  <DD>
  <P>RGSS &#25152;&#20351;&#29992;&#30340; DLL&#26723;&#26696;&#65292;&#36890;&#24120;&#23433;&#35013;&#22312; RTP &#25991;&#20214;&#22841;&#20013;&#12290;</P>
  <P>&#22914;&#26524;&#28216;&#25103;&#25991;&#20214;&#22841;&#20013;&#26377;&#25351;&#23450;&#30340;DLL&#26723;&#65292;&#23601;&#20250;&#20248;&#20808;&#20351;&#29992;&#12290;</P>
  <DT>Scripts
  <DD>
  <P>&#20648;&#23384;&#33050;&#26412;&#30340;&#25991;&#20214;&#65292;&#25351;&#23450;&#20854;&#22312;&#28216;&#25103;&#25991;&#20214;&#22841;&#30340;&#30456;&#23545;&#36335;&#24452;&#12290;</P>
  <P>Ruby&#30340;&#33050;&#26412;&#36890;&#24120;&#20197; .rb &#20316;&#20026;&#21518;&#32512;&#21517;&#65292;&#20294;&#26159;RGSS&#26159;&#20351;&#29992;&#29305;&#27530;&#30340;&#26041;&#27861;&#21387;&#32553;&#25104;&#19968;&#20010;&#25991;&#20214;&#12290;&#36825;&#20010;&#25991;&#20214;&#36890;&#24120;&#21482;&#33021;&#29992;RPG Maker VX
  Ace&#30340;&#33050;&#26412;&#32534;&#36753;&#22120;&#25171;&#24320;&#12290;&#20854;&#20013;&#30340;&#25968;&#25454;&#30001;&#33050;&#26412;&#32452;&#25104;&#65292;&#25353;&#29031;&#26174;&#31034;&#30340;&#39034;&#24207;&#25191;&#34892;&#12290;</P>
  <DT>Title
  <DD>
  <P>&#28216;&#25103;&#26631;&#39064;&#65292;&#22312;&#28216;&#25103;&#31383;&#21475;&#30340;&#26631;&#39064;&#26639;&#26174;&#31034;&#12290;</P></DD></DL>
<H2><A name=rgss_rtp>RGSS-RTP</A></H2>
<P>RTP (Run-Time
Package)&#65292;&#26159;&#29992;&#26469;&#20943;&#23569;&#21457;&#24067;&#28216;&#25103;&#25991;&#20214;&#22823;&#23567;&#30340;&#26500;&#20214;&#65292;RTP&#21253;&#21547;&#20102;&#35768;&#22810;&#28216;&#25103;&#20849;&#20139;&#30340;&#26631;&#20934;&#22270;&#25991;&#20214;&#21644;&#38899;&#20048;&#25991;&#20214;&#65292;&#28216;&#25103;&#21069;&#23433;&#35013;&#36825;&#20123;&#20849;&#20139;&#25991;&#20214;&#21487;&#20197;&#20813;&#20110;&#37325;&#22797;&#19979;&#36733;&#36825;&#20123;&#25991;&#20214;&#12290;</P>
<P>RTP
&#25991;&#20214;&#21487;&#20197;&#20351;&#29992;&#19979;&#21015;&#20869;&#24314;&#28216;&#25103;&#24211;&#30340;&#26041;&#27861;&#35843;&#29992;&#65292;&#23601;&#19982;&#35843;&#29992;&#28216;&#25103;&#25991;&#20214;&#22841;&#19979;&#30340;&#25991;&#20214;&#19968;&#26679;&#12290;&#22312;&#35843;&#29992;&#19979;&#38754;&#30340;&#26041;&#27861;&#26102;&#65292;&#25991;&#20214;&#30340;&#21518;&#32512;&#21517;&#65288;&#22914;&#65306;.png&#12289;.mid&#65289;&#20250;&#33258;&#21160;&#21028;&#26029;&#65292;&#22240;&#27492;&#21487;&#20197;&#30465;&#30053;&#19981;&#20889;&#12290;</P>
<P><A href="gc_bitmap.html#new">Bitmap.new</A>, <A
href="gm_audio.html#bgm_play">Audio.bgm_play</A>, <A
href="gm_audio.html#bgs_play">Audio.bgs_play</A>, <A
href="gm_audio.html#me_play">Audio.me_play</A>, <A
href="gm_audio.html#se_play">Audio.se_play</A>, <A
href="gm_graphics.html#transition">Graphics.transition</A></P>
<H3><FONT face=Verdana>&#23433;&#35013;&#25968;&#25454;</FONT></H3>
<P>RPG Maker VX
Ace&nbsp;&#20013;&#21807;&#19968;&#26631;&#20934;&#30340;RTP&#38598;&#23601;&#26159;"RPGVXAce"&#65292;&#20294;&#26159;&#29616;&#22312;&#20320;&#24050;&#32463;&#21487;&#20197;&#33258;&#34892;&#21019;&#24314;&#29420;&#31435;&#30340;RTP&#38598;&#20102;&#12290;&#22914;&#26524;&#20320;&#30693;&#36947;&#22914;&#20309;&#21046;&#20316;&#23433;&#35013;&#21253;&#65292;
&#37027;&#20040;&#20320;&#23601;&#21487;&#20197;&#36981;&#24490;&#20197;&#19979;&#35268;&#21017;&#26469;&#23450;&#21046;&#29420;&#29305;&#30340;RTP&#38598;&#12290;</P>
<P>&#19968;&#33324;&#26469;&#35828;&#65292;RTP&#20250;&#34987;&#23433;&#35013;&#36827;&#36825;&#20010;&#30446;&#24405;&#65306; </P><PRE><FONT face=Verdana>[CommonFilesFolder]\Enterbrain\RGSS3\[RTPName]
</FONT></PRE>&#36825;&#37324;&#30340; [CommonFilesFolder] &#20854;&#23454;&#23601;&#26159;&#25805;&#20316;&#31995;&#32479;&#20013;&#30340; “Common Files &#25991;&#20214;&#22841;&#65292;&nbsp;&#32780;
[RTPName] &#21017;&#26159;RTP&#38598;&#30340;&#21517;&#23383;&#12290;&#27604;&#22914;&#65306; <PRE><FONT face=Verdana>C:\Program Files\Common Files\Enterbrain\RGSS3\Standard
</FONT></PRE>
<P>RTP&#23433;&#35013;&#31243;&#24207;&#20250;&#22312;&#36825;&#20010;&#20301;&#32622;&#20889;&#20837;&#19968;&#20010;&#23383;&#31526;&#20018;&#31867;&#22411;&#30340;&#38190;&#20540;&#20197;&#23450;&#20301;RTP&#25991;&#20214;&#20301;&#32622;&nbsp;"HKEY_LOCAL_MACHINE\SOFTWARE\Enterbrain\RGSS3\RTP"&#65292;RGSS
&#33050;&#26412;&#20195;&#30721;&#20063;&#20250;&#36890;&#36807;&#36825;&#20010;&#38190;&#20540;&#26469;&#36830;&#25509;&#21040;RTP&#20013;&#30340;&#25991;&#20214;&#12290;.</P>
<H2>&#21152;&#23494;&#26723;&#26696;</H2>
<P style="MARGIN-RIGHT: 0px"
dir=ltr>&#23545;&#28216;&#25103;&#36827;&#34892;&#21152;&#23494;&#65292;&#21487;&#20197;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#38450;&#27490;&#21035;&#20154;&#23545;&#28216;&#25103;&#36827;&#34892;&#20462;&#25913;/&#20998;&#26512;&#12290;&#20320;&#21487;&#20197;&#36890;&#36807;&#22312;&#21046;&#20316;&#28216;&#25103;&#21457;&#34892;&#21253;&#26102;&#21246;&#36873;"&#29983;&#25104;&#21152;&#23494;&#25968;&#25454;&#25991;&#20214;"&#26469;&#23545;&#28216;&#25103;&#30340;&#25968;&#25454;&#24211;&#21644;&#32032;&#26448;&#36827;&#34892;&#21152;&#23494;&#65292;&#36825;&#20123;&#25968;&#25454;&#23558;&#20250;&#22312;&#21152;&#23494;&#21518;&#34987;&#25171;&#21253;&#36827;"Game.rgss3a"&#25991;&#20214;&#24403;&#20013;&#65292;&#20294;&#35201;&#27880;&#24847;&#65292;&#34987;&#21152;&#23494;&#30340;&#32032;&#26448;&#20013;&#24182;&#19981;&#21253;&#25324;&#38899;&#39057;&#21644;&#23383;&#20307;&#25991;&#20214;&#12290;</P>
<BLOCKQUOTE style="MARGIN-RIGHT: 0px" dir=ltr>
  <P style="MARGIN-RIGHT: 0px"
  dir=ltr>&#23545;&#20110;&#24050;&#32463;&#34987;&#25171;&#21253;&#36827;&#21152;&#23494;&#26723;&#26696;&#20013;&#30340;&#32032;&#26448;&#25991;&#20214;&#65292;&#20320;&#21487;&#36890;&#36807;&#20197;&#19979;&#20869;&#32622;&#20989;&#25968;&#36827;&#34892;&#35843;&#29992;——&#23601;&#20687;&#35843;&#29992;&#21407;&#25991;&#20214;&#22841;&#20013;&#30340;&#25991;&#20214;&#19968;&#26679;&#65306;</P>
  <P><A href="g_functions.html#load_data">load_data</A>, <A
  href="gc_bitmap.html#new">Bitmap.new</A>, <A
  href="gm_graphics.html#transition">Graphics.transition</A></P>
  <P style="MARGIN-RIGHT: 0px" dir=ltr>&#24403;&#31243;&#24207;&#22312;&#28216;&#25103;&#30446;&#24405;&#19979;&#26816;&#27979;&#21040;&#21152;&#23494;&#26723;&#26696;&#30340;&#26102;&#20505;&#65292;&#22312; <A
  href="ata/Local/Temp/RPGVXAce/rgss/rgss.html#game_ini">Game.ini</A>
  &#20013;&#25351;&#23450;&#30340;&#33050;&#26412;&#25991;&#20214;&#65288;&#19968;&#33324;&#26159;Data\Scripts.rvdata&#65289;&#36890;&#24120;&#19981;&#20250;&#34987;&#35299;&#35835;&#65292;&#32780;&#26159;&#30452;&#25509;&#35835;&#21462;&#21152;&#23494;&#26723;&#26696;&#20013;&#30340;&#33050;&#26412;&#65292;&#36825;&#20063;&#26159;&#20026;&#20102;&#38450;&#27490;&#20854;&#20182;&#20154;&#36890;&#36807;&#36816;&#34892;&#22806;&#37096;&#33050;&#26412;&#32780;&#36798;&#21040;&#35835;&#21462;&#20869;&#37096;&#25991;&#20214;&#30340;&#30446;&#30340;&#12290;</P></BLOCKQUOTE>
<P>&#37492;&#20110;&#21152;&#23494;&#26723;&#26696;&#30340;&#35774;&#35745;&#21021;&#34935;&#65292;&#25105;&#20204;&#19981;&#20250;&#20844;&#24067;&#20219;&#20309;&#20851;&#20110;&#30456;&#20851;&#21152;&#23494;&#31639;&#27861;&#30340;&#20449;&#24687;&#65292;&#35831;&#19981;&#35201;&#35797;&#22270;&#20998;&#26512;&#25110;&#32773;&#30772;&#35299;&#23427;&#12290;</P>
<H2 style="MARGIN-RIGHT: 0px" dir=ltr>&#20854;&#20182;</H2>
<H3><A name=ext_lib><FONT face=Verdana>&#25193;&#23637;&#24211;</FONT></A></H3>
<P>RGSS &#26080;&#27861;&#21152;&#36733;&#22312;C&#35821;&#35328;&#29615;&#22659;&#19979;&#32534;&#20889;&#30340;Ruby&#25193;&#23637;&#24211;.&#65292;&#36825;&#20063;&#26159;&#20026;&#20160;&#20040;&#25105;&#20204;&#20801;&#35768;&#21152;&#36733;&#20197;&#19979;&#31867;&#22411;&#30340;&#25193;&#23637;&#24211;&#30340;&#21407;&#22240;&#65306;</P>
<UL>
  <LI>dl
  <LI>zlib
  <LI>single_byte
  <LI>utf_16_32
  <LI>japanese_sjis
  <LI>Win32API </LI></UL>
<H3><A name=character_code><FONT face=Verdana>&#23383;&#31526;&#38598;</FONT></A></H3>
<P>RGSS &#20351;&#29992;&#30340;&#26159; UTF-8 &#23383;&#31526;&#32534;&#30721;&#12290; UTF-8&nbsp;&#26159; Unicode &#23383;&#31526;&#32534;&#30721;&#30340;&#19968;&#20010;&#20998;&#25903;&#65292;&#32780; Unicode
&#23383;&#31526;&#32534;&#30721;&#21487;&#20197;&#25903;&#25345;&#19990;&#30028;&#19978;&#25152;&#26377;&#31867;&#22411;&#25991;&#23383;&#30340;&#26174;&#31034;&#12290;</P>
<P>RPG Maker &#25152;&#36755;&#20986;&#30340;&#25991;&#20214;&#20013;&#65292;&#32534;&#30721;&#26041;&#24335;&#20840;&#37096;&#20026; UTF-8 &#65292;&#25152;&#20197;&#19981;&#24517;&#25285;&#24515;&#22240;&#20026;&#23383;&#31526;&#32534;&#30721;&#26041;&#24335;&#19981;&#21516;&#32780;&#20135;&#29983;&#30340;&#20914;&#31361;&#12290;</P>
<H3><A name=property><FONT face=Verdana>&#23646;&#24615;</FONT></A></H3>
<P>"&#23646;&#24615;"&#26159;&#19968;&#20010;&nbsp;<A href="g_index.html">&#28216;&#25103;&#24211;</A> &#20013;&#30340;&#27010;&#24565;&#65292;&#23427;&#24182;&#38750; Ruby &#37324;&#20986;&#29616;&#30340;&#27010;&#24565;&#65292;&#32780;&#26159;&#19968;&#31181; RGSS
&#20013;&#29420;&#26377;&#30340;&#27010;&#24565;&#12290;</P>
<P>&#27604;&#22914;&#65292;&#21033;&#29992;&#19979;&#38754;&#30340;&#20195;&#30721;&#21487;&#20197;&#33719;&#21462;&#21644;&#35774;&#23450;&#19968;&#20010;&#31934;&#28789;&#30340;&#22352;&#26631;(<A href="gc_sprite.html#x">Sprite#x</A>)&#65306;</P><PRE><FONT face=Verdana>x = sprite1.x            # &#33719;&#21462;
sprite2.x = x + 32    # &#35774;&#23450;</FONT></PRE>
<P>&#20026;&#20102;&#26041;&#20415;&#36215;&#35265;&#65292;&#36825;&#34987;&#23450;&#20041;&#20026;&#21487;&#36890;&#36807;&#36171;&#20540;&#36816;&#31639;&#31526;&#36827;&#34892;&#33719;&#21462;&#65288;&#35835;&#20986;&#65289;&#21644;&#35774;&#23450;&#65288;&#20889;&#20837;&#65289;&#30340;&#26041;&#27861;&#65292;&#23601;&#31216;&#20026;"&#23646;&#24615;"&#12290;</P>
<P>&#20294;&#26159;&#22914;&#21516; <A href="gc_color.html">Color</A>&nbsp;&#31867;&#12289; <A
href="gc_tone.html">Tone</A>&nbsp;&#31867;&#12289;&nbsp;<A href="gc_rect.html">Rect</A>&nbsp;&#31867;
&#30340;&#23545;&#35937;&#65292;&#25152;&#36820;&#22238;&#30340;&#26159;&#23545;&#35937;&#30340;&#21442;&#29031;&#20540;&#65292;&#32780;&#38750;&#23545;&#35937;&#30340;&#21103;&#26412;&#12290;&#22240;&#27492;&#21487;&#20197;&#29992;&#19979;&#38754;&#30340;&#26684;&#24335;&#20462;&#25913;&#23383;&#20307;&#39068;&#33394;&#65306;</P><PRE><FONT face=Verdana>color = font1.color
color.set(255, 0, 0)</FONT></PRE>
<H6>&nbsp;</H6></BODY></HTML>
