<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML lang=zh><HEAD><TITLE>Variables and Constants</TITLE>
<META content="text/html; charset=ISO-8859-1" http-equiv=Content-Type>
<META content=text/css http-equiv=Content-Style-Type><LINK rel=stylesheet 
type=text/css href="../style.css">
<META name=GENERATOR content="MSHTML 8.00.7601.17744"></HEAD>
<BODY>
<H1 align=left><FONT face=Verdana>&#21464;&#37327;&#19982;&#24120;&#37327;</FONT></H1>
<UL>
  <LI>
  <DIV align=left><A href="#L000225">&#21306;&#22495;&#21464;&#37327;</A> </DIV>
  <LI>
  <DIV align=left><A href="#L000226">&#23454;&#20363;&#21464;&#37327;</A> </DIV>
  <LI>
  <DIV align=left><A href="#L000227">&#31867;&#21464;&#37327;</A> </DIV>
  <LI>
  <DIV align=left><A href="#L000228">&#20840;&#23616;&#21464;&#37327;</A> </DIV>
  <LI>
  <DIV align=left><A href="#L000229">&#20266;&#21464;&#37327;</A> </DIV>
  <LI>
  <DIV align=left><A href="#L000236">&#24120;&#37327;</A> </DIV></LI></UL>
<P align=left>&#22312; Ruby &#20043;&#20013;&#65292;&#21464;&#37327;&#30340;&#31867;&#22411; &#9472;&#9472; &#26080;&#35770;&#26159;&#21306;&#22495;&#12289;&#23454;&#20363;&#12289;&#31867;&#12289;&#20840;&#23616;&#21464;&#37327;&#36824;&#26159;&#24120;&#37327; &#9472;&#9472; 
&#37117;&#26159;&#20197;&#21517;&#31216;&#30340;&#31532;&#19968;&#20010;&#23383;&#31526;&#26469;&#20915;&#23450;&#30340;&#12290;&#36890;&#24120;&#21464;&#37327;&#21517;&#31216;&#65292;&#38500;&#20102;&#31532;&#19968;&#20010;&#23383;&#31526;&#20197;&#22806;&#65292;&#37117;&#26159;&#30001;&#33521;&#25968;&#23383;&#31526;&#25110;&#19979;&#21010;&#32447;&#25152;&#32452;&#25104;&#12290;&#19981;&#36807;&#26377;&#20123;&#20869;&#24314;&#21464;&#37327;&#26159;&#30001;&#12300;$&#12301;+&#19968;&#20010;&#23383;&#31526;&#25152;&#32452;&#25104;&#30340;&#12290;&#65288;&#21442;&#30475; <A 
href="s_variables.html">&#20869;&#24314;&#21464;&#37327;</A>&nbsp;&#65289;</P>
<P align=left>&#21464;&#37327;&#25110;&#24120;&#37327;&#20250;&#25351;&#21521;&#29305;&#23450;&#23545;&#35937;&#65292;&#23558;&#23545;&#35937;&#20195;&#20837;&#21464;&#37327;/&#24120;&#37327;&#21482;&#26159;&#21464;&#26356;&#20102;&#25351;&#23450;&#30340;&#23545;&#35937;&#65292;&#24182;&#19981;&#20250;&#22797;&#21046;&#35813;&#23545;&#35937;&#30340;&#23454;&#20363;&#12290;</P>
<H2 align=left>&#21306;&#22495;&#21464;&#37327;</H2>
<P align=left>&#23454;&#20363;&#65306;</P>
<DIV align=left><PRE><FONT face=Verdana>foobar</FONT></PRE></DIV>
<P>&#20197;&#23567;&#20889;&#23383;&#27597;&#25110;&#26159;&#19979;&#21010;&#32447;&#24320;&#22836;&#30340;&#26631;&#35782;&#31526;&#23601;&#26159;&#21306;&#22495;&#21464;&#37327;&#25110;&#26159;&#26041;&#27861;&#35843;&#29992;&#12290;</P>
<P>&#22312;&#21306;&#22495;&#21464;&#37327;&#20316;&#29992;&#21306;&#65288;&#31867;&#12289;&#27169;&#22359;&#12289;&#26041;&#27861;&#23450;&#20041;&#65289;&#20869;&#65292;&#21021;&#27425;&#23545;&#36825;&#31867;&#30340;&#26631;&#35782;&#31526;&#36171;&#20540;&#21017;&#35270;&#20026;&#65288;&#35813;&#21306;&#20869;&#30340;&#65289;&#21464;&#37327;&#22768;&#26126;&#12290;&#24341;&#29992;&#26410;&#22768;&#26126;&#30340;&#26631;&#35782;&#31526;&#21017;&#35270;&#20026;&#35843;&#29992;&#26080;&#21442;&#25968;&#30340;&#26041;&#27861;&#12290;</P>
<H2 align=left><A name=L000226>&#23454;&#20363;&#21464;&#37327;</A></H2>
<P align=left>&#23454;&#20363;&#65306;</P>
<DIV align=left><PRE><FONT face=Verdana>@foobar</FONT></PRE></DIV>
<P>&#20197;&#12300;<FONT 
face=Verdana><CODE>@&#12301;</CODE>&#24320;&#22836;&#30340;&#21464;&#37327;&#23601;&#26159;&#23454;&#20363;&#21464;&#37327;&#65292;&#23646;&#20110;&#29305;&#23450;&#23545;&#35937;&#12290;&#23454;&#20363;&#21464;&#37327;&#21487;&#20197;&#22312;&#20219;&#20309;&#26412;&#31867;&#25110;&#23376;&#31867;&#26041;&#27861;&#20869;&#24341;&#29992;&#12290;&#24341;&#29992;&#26102;&#65292;&#26410;&#21021;&#22987;&#21270;&#30340;&#23454;&#20363;&#21464;&#37327;&#20854;&#20540;&#20026; 
nil&#12290;</FONT></P>
<H2 align=left><A name=L000227>&#31867;&#21464;&#37327;</A></H2>
<P align=left>&#23454;&#20363;&#65306;</P>
<DIV align=left><PRE><FONT face=Verdana>class Foo
  @@foo = 1
  def bar
    puts @@foo
  end
end</FONT></PRE></DIV>
<P>&#20197;&#12300;<FONT 
face=Verdana><CODE>@@</CODE>&#12301;&#24320;&#22836;&#30340;&#21464;&#37327;&#23601;&#26159;&#31867;&#21464;&#37327;&#12290;&#31867;&#21464;&#37327;&#22312;&#31867;&#23450;&#20041;&#20013;&#22768;&#26126;&#65292;&#21487;&#20197;&#30001;&#29305;&#27530;&#31867;&#26041;&#27861;&#25110;&#23454;&#20363;&#26041;&#27861;&#31561;&#25152;&#24341;&#29992;/&#36171;&#20540;&#12290;</FONT></P>
<P align=left>&#31867;&#21464;&#37327;&#19982; <A href="#L000236">&#24120;&#37327;</A> &#30340;&#24046;&#24322;&#22914;&#19979;&#65306;</P>
<UL>
  <LI>&#31867;&#21464;&#37327;&#21487;&#20197;&#37325;&#26032;&#36171;&#20540;&#65288;&#33509;&#23545;&#24120;&#37327;&#25191;&#34892;&#21017;&#20250;&#20986;&#29616;&#35686;&#21578;&#12290;&#65289;&nbsp; 
  <LI>&#26080;&#27861;&#22312;&#26412;&#31867;&#20197;&#22806;&#30452;&#25509;&#24341;&#29992;&#65292;&#20294;&#21487;&#20197;&#22312;&#23376;&#31867;&#20013;&#24341;&#29992;/&#36171;&#20540;&#12290; </LI></UL>
<H2 align=left><A name=L000228>&#20840;&#23616;&#21464;&#37327;</A></H2>
<P align=left>&#23454;&#20363;&#65306;</P>
<DIV align=left><PRE><FONT face=Verdana>$foobar</FONT></PRE></DIV>
<P>&#20197;&#12300;$&#12301;&#24320;&#22836;&#30340;&#21464;&#37327;&#23601;&#26159;&#20840;&#23616;&#21464;&#37327;&#65292;&#21487;&#20197;&#22312;&#31243;&#24207;&#20013;&#20219;&#20309;&#19968;&#22788;&#24341;&#29992;&#65288;&#22240;&#27492;&#20351;&#29992;&#26102;&#35201;&#29305;&#21035;&#27880;&#24847;&#65289;&#12290;&#20840;&#23616;&#21464;&#37327;&#19981;&#38656;&#35201;&#22768;&#26126;&#65292;&#24341;&#29992;&#26102;&#33509;&#26410;&#21021;&#22987;&#21270;&#20854;&#20540;&#20026; nil&#12290;</P>
<H2 align=left><A name=L000229>&#20266;&#21464;&#37327;</A></H2>
<P>&#38500;&#20102;&#19968;&#33324;&#21464;&#37327;&#22806;&#65292;&#36824;&#26377;&#19968;&#31181;&#21483;&#20570;&#20266;&#21464;&#37327;&#30340;&#29305;&#27530;&#21464;&#37327;&#12290;</P>
<DL>
  <DT>
  <DIV align=left>self </DIV>
  <DD>
  <P>&#24403;&#21069;&#26041;&#27861;&#30340;&#25191;&#34892;&#23545;&#35937;&#26412;&#36523;&#12290;</P>
  <DT>
  <DIV align=left>nil </DIV>
  <DD>
  <P align=left><A href="sc_nilclass.html">NilClass</A> &#31867;&#21807;&#19968;&#30340;&#23454;&#20363;&#12290;&#34920;&#31034;&#20266;&#12290;</P>
  <DT>
  <DIV align=left>true </DIV>
  <DD>
  <P align=left><A href="sc_trueclass.html">TrueClass</A> &#31867;&#21807;&#19968;&#30340;&#23454;&#20363;&#12290;&#34920;&#31034;&#30495;&#12290;</P>
  <DT>
  <DIV align=left>false </DIV>
  <DD>
  <P align=left><A href="sc_falseclass.html">FalseClass</A> 
&#31867;&#21807;&#19968;&#30340;&#23454;&#20363;&#12290;&#34920;&#31034;&#20266;&#12290;</P></DD></DL>
<P>&#20266;&#21464;&#37327;&#30340;&#20540;&#26080;&#27861;&#20462;&#25913;&#65292;&#23545;&#20266;&#21464;&#37327;&#36171;&#20540;&#20250;&#20986;&#29616;&#35821;&#27861;&#38169;&#35823;&#12290;</P>
<H2 align=left><A name=L000236>&#24120;&#37327;</A></H2>
<P align=left>&#23454;&#20363;&#65306;</P>
<DIV align=left><PRE><FONT face=Verdana>FOOBAR</FONT></PRE></DIV>
<P align=left>&#20197;&#22823;&#20889;&#33521;&#25991;&#23383;&#27597;&#24320;&#22836;&#30340;&#26631;&#35782;&#31526;&#20026;&#24120;&#37327;&#12290;&#23545;&#24120;&#37327;&#36171;&#20540;&#23601;&#26159;&#23450;&#20041;&#65288;&#19982;&#21021;&#22987;&#21270;&#65289;&#65307;&#24120;&#37327;&#19981;&#21487;&#22312;&#26041;&#27861;&#20013;&#22768;&#26126;&#12290;&#23384;&#21462;&#26410;&#23450;&#20041;&#24120;&#37327;&#20250;&#20135;&#29983; <A 
href="s_exceptions.html#NameError">NameError</A> &#24322;&#24120;&#12290;</P>
<P>&#24120;&#37327;&#21487;&#20197;&#22312;&#31867;&#25110;&#27169;&#22359;&#20013;&#23450;&#20041;&#65292;&#21487;&#20197;&#30001;&#23376;&#31867;&#12289;&#21253;&#21547;&#35813;&#27169;&#22359;&#30340;&#31867;&#12289;&#21644;&#35813;&#27169;&#22359;&#25152;&#24341;&#29992;&#12290;&#22312;&#31867;/&#27169;&#22359;&#22806;&#24341;&#29992;&#24120;&#37327;&#38656;&#35201;&#20351;&#29992;&#36816;&#31639;&#31526;&#12300;::&#12301;&#12290;</P>
<DIV align=left><PRE><FONT face=Verdana>class Foo
  FOO = 'FOO'
end

class Bar &lt; Foo
  p FOO             # =&gt; "FOO"
end

p Foo::FOO          # =&gt; "FOO"</FONT></PRE></DIV>
<P>&#31867;&#21644;&#27169;&#22359;&#30340;&#21517;&#31216;&#35270;&#20026;&#24120;&#25968;&#22788;&#29702;&#12290;</P>
<H6 align=left></H6></BODY></HTML>
