<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML lang=en><HEAD><TITLE>Class and Method Definitions</TITLE>
<META content="text/html; charset=ISO-8859-1" http-equiv=Content-Type>
<META content=text/css http-equiv=Content-Style-Type><LINK rel=stylesheet 
type=text/css href="../style.css">
<META name=GENERATOR content="MSHTML 8.00.7601.17744"></HEAD>
<BODY>
<H1><FONT face=Verdana>&#31867;&#23450;&#20041;&#19982;&#26041;&#27861;&#23450;&#20041;</FONT></H1>
<UL>
  <LI><A href="#L000327">&#31867;&#30340;&#23450;&#20041;</A> 
  <LI><A href="#L000329">&#27169;&#22359;&#30340;&#23450;&#20041;</A> 
  <LI><A href="#L000330">&#26041;&#27861;&#30340;&#23450;&#20041;</A> 
  <UL>
    <LI><A href="#L000332">&#26041;&#27861;&#27714;&#20540;</A> </LI></UL>
  <LI><A href="#L000333">&#29305;&#27530;&#26041;&#27861;&#30340;&#23450;&#20041;</A> 
  <LI><A href="#L000334">&#31867;&#26041;&#27861;&#30340;&#23450;&#20041;</A> 
  <LI><A href="#L000336">&#23450;&#20041;&#25805;&#20316;</A> 
  <UL>
    <LI><A href="#L000337">alias</A> </LI></UL></LI></UL>
<H2>&#31867;&#30340;&#23450;&#20041;</H2>
<P>&#23454;&#20363;&#65306;</P><PRE><FONT face=Verdana>class Foo &lt; Super
  def test
     :
  end
     :
end</FONT></PRE>
<P>&#35821;&#27861;&#65306;</P><PRE><FONT face=Verdana>class &#26631;&#35782;&#31526; ['&lt;' &#36229;&#31867; ]
  &#34920;&#36798;&#24335; ..
end</FONT></PRE>
<P>&#20197;&#19978;&#35821;&#27861;&#21487;&#20197;&#23450;&#20041;&#19968;&#20010;&#31867;&#30340;&#20869;&#23481;&#12290;&#31867;&#30340;&#21517;&#31216;&#26159;&#22823;&#20889;&#23383;&#27597;&#24320;&#22836;&#30340;&#26631;&#35782;&#31526;&#12290;</P>
<P>&#31867;&#30340;&#23450;&#20041;&#23558;&#31867;&#30340;&#20869;&#23481;&#36171;&#20540;&#32473;&#19968;&#20010;&#30001;&#31867;&#21517;&#31216;&#26631;&#35782;&#31526;&#25152;&#25351;&#23450;&#30340;&#24120;&#37327;&#65288;&#22312;Ruby&#20063;&#26159;&#19968;&#20010;&#23545;&#35937;&#65292;&#26159; <A 
href="sc_class.html">Class</A> &#31867;&#30340;&#19968;&#20010;&#23454;&#20363;&#12290;&#65289;</P>
<P>&#22312;&#19968;&#20010;&#31867;&#24050;&#23450;&#20041;&#26102;&#65292;&#37325;&#20889;&#19968;&#20010;&#31867;&#23450;&#20041;&#20250;&#23558;&#26032;&#30340;&#20869;&#23481;&#38468;&#21152;&#21040;&#21407;&#26412;&#24050;&#23384;&#22312;&#30340;&#31867;&#23450;&#20041;&#20013;&#12290;</P><PRE><FONT face=Verdana>class Foo &lt; Array
  def foo
  end
end

class Foo
  def bar
  end
end</FONT></PRE>
<P>&#22312;&#31867;&#23450;&#20041;&#20043;&#20013;&#65292;self &#23601;&#26159;&#25351;&#35813;&#31867;&#26412;&#36523;&#65292;&#21542;&#21017;&#19982;&#39030;&#23618;&#23450;&#20041;&#30456;&#21516;&#12290;&#31867;&#23450;&#20041;&#20013;&#21487;&#20197;&#21253;&#21547;&#20219;&#20309;&#34920;&#36798;&#24335;&#65292;&#23450;&#20041;&#31867;&#26102;&#20250;&#25191;&#34892;&#36825;&#20123;&#34920;&#36798;&#24335;&#12290;</P>
<P>&#31867;&#23450;&#20041;&#21487;&#20197;&#23884;&#22871;&#36816;&#34892;&#12290;&#22312;&#19979;&#38754;&#30340;&#33539;&#20363;&#24403;&#20013;&#65292;&#20869;&#37096;&#30340;&#31867; (Bar) &#19982;&#22806;&#37096;&#30340;&#31867; (Foo) &#23436;&#20840;&#27809;&#26377;&#20989;&#25968;&#19978;&#30340;&#20851;&#32852;&#65288;&#22914;&#32487;&#25215;&#65289;&#65292;&#21807;&#19968;&#30340;&#20851;&#32852;&#26159;&#24120;&#25968; Bar &#23646;&#20110; Foo 
&#30340;&#20869;&#37096;&#24120;&#25968; Foo::Bar&#21482;&#26377;&#20195;&#34920;&#20869;&#37096;&#30340;&#31867;&#19982;&#22806;&#37096;&#30340;&#31867;&#65288;&#25110;&#27169;&#22359;&#65289;&#35821;&#24847;&#19978;&#30456;&#20851;&#65292;&#21487;&#20197;&#34920;&#36798;&#21253;&#21547;&#30340;&#20851;&#31995;&#12290;</P><PRE><FONT face=Verdana>class Foo
  class Bar
  end
end</FONT></PRE>
<P>&#31867;&#23450;&#20041;&#34920;&#36798;&#24335;&#36820;&#22238;&#26368;&#21518;&#35745;&#31639;&#30340;&#34920;&#36798;&#24335;&#35745;&#31639;&#20540;&#12290;&#33509;&#35813;&#34920;&#36798;&#24335;&#26080;&#36820;&#22238;&#20540;&#65292;&#21017;&#36820;&#22238; nil&#12290;</P>
<H2>&#27169;&#22359;&#30340;&#23450;&#20041;</H2>
<P>&#23454;&#20363;&#65306;</P><PRE><FONT face=Verdana>module Foo
  def test
     :
  end
     :
end</FONT></PRE>
<P>&#35821;&#27861;&#65306;</P><PRE><FONT face=Verdana>module &#26631;&#35782;&#31526;
  &#34920;&#36798;&#24335; ..
end</FONT></PRE>
<P>&#20197;&#19978;&#35821;&#27861;&#21487;&#20197;&#23450;&#20041;&#19968;&#20010;&#27169;&#22359;&#30340;&#20869;&#23481;&#12290;&#27169;&#22359;&#30340;&#21517;&#31216;&#26159;&#22823;&#20889;&#23383;&#27597;&#24320;&#22836;&#30340;&#26631;&#35782;&#31526;&#12290;</P>
<P>&#27169;&#22359;&#30340;&#23450;&#20041;&#23558;&#31867;&#30340;&#20869;&#23481;&#36171;&#20540;&#32473;&#19968;&#20010;&#30001;&#27169;&#22359;&#21517;&#31216;&#26631;&#35782;&#31526;&#25152;&#25351;&#23450;&#30340;&#24120;&#37327;&#65288;&#22312;Ruby&#20063;&#26159;&#19968;&#20010;&#23545;&#35937;&#65292;&#26159; <A 
href="sc_module.html">Module</A> &#31867;&#30340;&#19968;&#20010;&#23454;&#20363;&#12290;&#65289;</P>
<P>&#22312;&#19968;&#20010;&#27169;&#22359;&#24050;&#23450;&#20041;&#26102;&#65292;&#37325;&#20889;&#19968;&#20010;&#27169;&#22359;&#23450;&#20041;&#20250;&#23558;&#26032;&#30340;&#20869;&#23481;&#38468;&#21152;&#21040;&#21407;&#26412;&#24050;&#23384;&#22312;&#30340;&#27169;&#22359;&#23450;&#20041;&#20013;&#12290;</P>
<P>&#27169;&#22359;&#23450;&#20041;&#34920;&#36798;&#24335;&#36820;&#22238;&#26368;&#21518;&#35745;&#31639;&#30340;&#34920;&#36798;&#24335;&#35745;&#31639;&#20540;&#12290;&#33509;&#35813;&#34920;&#36798;&#24335;&#26080;&#36820;&#22238;&#20540;&#65292;&#21017;&#36820;&#22238; nil&#12290;</P>
<H2>&#26041;&#27861;&#30340;&#23450;&#20041;</H2>
<P>&#23454;&#20363;&#65306;</P><PRE><FONT face=Verdana>def fact(n)
  if n == 1 then
     1
  else
    n * fact(n-1)
  end
end</FONT></PRE>
<P>&#35821;&#27861;&#65306;</P><PRE><FONT face=Verdana>def &#26041;&#27861;&#21517;&#31216; ['(' [&#21442;&#25968; ['=' &#21442;&#25968;&#40664;&#35748;&#20540;]] ... [',' '*' &#21442;&#25968;] ')']
  &#34920;&#36798;&#24335; ..
[rescue [&#24322;&#24120;&#31867;&#22411;,..] [then]
  &#34920;&#36798;&#24335; ..]..
[ensure
  &#34920;&#36798;&#24335; ..]
end</FONT></PRE>
<P>&#20197;&#19978;&#35821;&#27861;&#21487;&#20197;&#23450;&#20041;&#19968;&#20010;&#26041;&#27861;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#65288;&#22312;&#31867;&#23450;&#20041;&#25110;&#27169;&#22359;&#23450;&#20041;&#20013;&#65289;&#23450;&#20041;&#19968;&#20010;&#31867;&#25110;&#27169;&#22359;&#25152;&#25317;&#26377;&#30340;&#26041;&#27861;&#12290;&#22312;&#39030;&#23618;&#23450;&#20041;&#30340;&#35805;&#65292;&#21017;&#23450;&#20041;&#30340;&#26041;&#27861;&#21487;&#20197;&#22312;&#20219;&#20309;&#22320;&#26041;&#35843;&#29992;&#12290;&#36825;&#31867;&#30340;&#26041;&#27861;&#21487;&#20197;&#19982;&#20854;&#20182;&#33050;&#26412;&#35821;&#35328;&#30340;&#12300;&#20989;&#25968;&#12301;&#19968;&#26679;&#35843;&#29992;&#12290;</P>
<P>&#26041;&#27861;&#30340;&#21517;&#31216;&#21487;&#20197;&#26159;&#19968;&#33324;&#30340;&#26631;&#35782;&#31526;&#25110;&#26159;&#21487;&#37325;&#26032;&#23450;&#20041;&#30340;&#36816;&#31639;&#31526;&#65288;==&#12289; +&#12289; - &#31561;&#65292;&#21442;&#30475; <A 
href="syntax04.html">&#36816;&#31639;&#31526;&#34920;&#36798;&#24335;</A>&nbsp;&#65289;&#12290;</P>
<P>&#33509;&#26159;&#25552;&#20379;&#21442;&#25968;&#40664;&#35748;&#20540;&#65292;&#24403;&#35843;&#29992;&#27492;&#26041;&#27861;&#32780;&#27809;&#26377;&#25552;&#20379;&#21442;&#25968;&#26102;&#65292;&#21442;&#25968;&#40664;&#35748;&#20540;&#23601;&#20250;&#21462;&#20195;&#30495;&#27491;&#30340;&#21442;&#25968;&#12290;&#21442;&#25968;&#40664;&#35748;&#20540;&#30340;&#34920;&#36798;&#24335;&#22312;&#35843;&#29992;&#26041;&#27861;&#26102;&#35745;&#31639;&#20854;&#20540;&#12290;</P>
<P>&#24403;&#26368;&#21518;&#19968;&#20010;&#21442;&#25968;&#21517;&#31216;&#21069;&#38754;&#24102;&#26377; * &#21495;&#26102;&#65292;&#21518;&#38754;&#20854;&#20313;&#30340;&#25152;&#26377;&#21442;&#25968;&#20840;&#37096;&#20197;&#25968;&#32452;&#22411;&#24577;&#20256;&#36882;&#32473;&#24102; * &#30340;&#21442;&#25968;&#20013;&#12290;</P>
<P>&#23454;&#20363;&#65306;</P><PRE><FONT face=Verdana># &#26080;&#21442;&#25968;&#26041;&#27861;&#65292;&#20197;&#19979;&#26041;&#27861;&#20013;&#30340;end&#30465;&#30053;<BR>def foo
end

# &#24102;&#21442;&#25968;&#26041;&#27861;<BR>def foo(arg, arg2)

# &#24102;&#21442;&#25968;&#40664;&#35748;&#20540;&#30340;&#26041;&#27861;<BR>def foo(arg = nil)

# &#21508;&#31181;&#21442;&#25968;&#20840;&#37096;&#21040;&#40784;<BR>def foo(arg, arg2, arg3 = nil, *rest)

# &#36816;&#31639;&#31526;&#26684;&#24335;<BR>def ==(other)
def +(other)
def *(other)</FONT></PRE>
<P>&#23450;&#20041;&#26041;&#27861;&#26102;&#65292;&#21508;&#31181;&#21442;&#25968;&#24517;&#39035;&#20197;&#19979;&#38754;&#30340;&#39034;&#24207;&#25351;&#23450;&#65292;&#20134;&#21487;&#30465;&#30053;&#19981;&#29992;&#65306;</P>
<UL>
  <LI>&#19981;&#24102;&#40664;&#35748;&#20540;&#30340;&#21442;&#25968;&#34920;&#36798;&#24335;&#65288;&#21487;&#20197;&#25351;&#23450;&#22810;&#20010;&#65289; 
  <LI>&#24102;&#40664;&#35748;&#20540;&#30340;&#21442;&#25968;&#34920;&#36798;&#24335;&#65288;&#21487;&#20197;&#25351;&#23450;&#22810;&#20010;&#65289; 
  <LI>&#24102;&nbsp;* &#30340;&#21442;&#25968;&#65288;&#26368;&#22810;&#25351;&#23450;&#19968;&#20010;&#65289; </LI></UL>
<P>&#19979;&#38754;&#26159;&#20960;&#20010;&#29305;&#27530;&#30340;&#21442;&#25968;&#23450;&#20041;&#26684;&#24335;&#65306;</P><PRE><FONT face=Verdana># &#19968;&#20803;&#21152;/&#20943;<BR>def +@
def -@

# &#36171;&#20540;&#21442;&#25968;<BR>def foo=(value)             # obj.foo = value

# [] &#21644; []=
def [](key)                 # obj[key]
def []=(key, value)         # obj[key] = value
def []=(key, key2, value)   # obj[key, key2] = value</FONT></PRE>
<P>&#27492;&#22806;&#65292;&#20063;&#21487;&#20197;&#25351;&#23450;&#22914; <A href="syntax05.html#L000314">begin</A> &#34920;&#36798;&#24335;&#20013;&#30340; rescue &#21644;/&#25110; ensure 
&#23376;&#21477;&#26469;&#25429;&#25417;&#25191;&#34892;&#26041;&#27861;&#26102;&#25152;&#25243;&#20986;&#30340;&#24322;&#24120;&#12290;</P>
<P>&#26041;&#27861;&#23450;&#20041;&#34920;&#36798;&#24335;&#36820;&#22238; nil&#12290;</P>
<H3><FONT face=Verdana>&#26041;&#27861;&#27714;&#20540;</FONT></H3>
<P>&#35843;&#29992;&#26041;&#27861;&#26102;&#65292;&#26041;&#27861;&#30340;&#34920;&#36798;&#24335;&#20197;&#19979;&#21015;&#30340;&#39034;&#24207;&#36827;&#34892;&#35745;&#31639;&#65306;</P>
<UL>
  <LI>&#21442;&#25968;&#40664;&#35748;&#20540;&#30340;&#34920;&#36798;&#24335;&#65288;&#33509;&#26377;&#25351;&#23450;&#30340;&#35805;&#65289; 
  <LI>&#35813;&#26041;&#27861;&#26412;&#36523;&#30340;&#20869;&#23481; 
  <LI>&#25243;&#20986;&#24322;&#24120;&#26102;&#65292;&#35745;&#31639;&#35813;&#26041;&#27861;&#30340; rescue &#25110; else &#23376;&#21477;&#65288;&#33509;&#26377;&#25351;&#23450;&#30340;&#35805;&#65289; 
  <LI>&#35813;&#26041;&#27861;&#30340;&nbsp;ensure &#23376;&#21477;&#65288;&#33509;&#26377;&#25351;&#23450;&#30340;&#35805;&#65289; </LI></UL>
<P>&#20197;&#19978;&#37117;&#26159;&#22312;&#26041;&#27861;&#20013;&#20381;&#29031;&#24773;&#20917;&#32780;&#36827;&#34892;&#35745;&#31639;&#65292;&#21253;&#25324;&#21442;&#25968;&#40664;&#35748;&#20540;&#30340;&#34920;&#36798;&#24335;&#12290;</P>
<P>&#26041;&#27861;&#30340;&#36820;&#22238;&#20540;&#23601;&#26159;&#20256;&#36882;&#32473; <A href="syntax05.html#L000317">return</A>&nbsp;&#30340;&#25968;&#20540;&#12290;&#33509;&#26159;&#27809;&#26377;&#35843;&#29992; 
return&#65292;&#21017;&#36820;&#22238;&#26041;&#27861;&#20013;&#65288;&#22312;ensure&#20043;&#21069;&#65289;&#26368;&#21518;&#35745;&#31639;&#30340;&#34920;&#36798;&#24335;&#12290;</P>
<P>&#26041;&#27861;&#19981;&#33021;&#22312;&#23450;&#20041;&#20043;&#21069;&#35843;&#29992;&#65292;&#27604;&#22914;&#35828;&#65306;</P><PRE><FONT face=Verdana>foo
def foo
  print "foo\n"
end</FONT></PRE>
<P>&#35843;&#29992;&#26410;&#23450;&#20041;&#26041;&#27861;&#20250;&#25243;&#20986; <A href="s_exceptions.html#NameError">NameError&#65288;&#24322;&#24120;&#65306;&#21517;&#31216;&#38169;&#35823;&#65289;</A> 
&#24322;&#24120;&#12290;</P>
<H2>&#29305;&#27530;&#26041;&#27861;&#30340;&#23450;&#20041;</H2>
<P>&#23454;&#20363;&#65306;</P><PRE><FONT face=Verdana>def foo.test
  print "this is foo\n"
end</FONT></PRE>
<P>&#35821;&#27861;&#65306;</P><PRE><FONT face=Verdana>def &#34920;&#36798;&#24335; '.' &#26631;&#35782;&#31526; ['(' [ &#21442;&#25968; ['=' &#21442;&#25968;&#40664;&#35748;&#20540;]] ... [',' '*' &#21442;&#25968; ]')']
  &#34920;&#36798;&#24335; ..
[rescue [&#24322;&#24120;&#31867;&#22411;,..] [then]
  &#34920;&#36798;&#24335; ..]..
[else
  &#34920;&#36798;&#24335; ..]
[ensure
  &#34920;&#36798;&#24335; ..]
end</FONT></PRE>
<P>&#29305;&#27530;&#26041;&#27861;&#26159;&#19987;&#23646;&#20110;&#19968;&#20010;&#23545;&#35937;&#32780;&#19981;&#26159;&#19968;&#20010;&#31867;&#12290;&#29305;&#27530;&#26041;&#27861;&#19981;&#33021;&#22815;&#23884;&#22871;&#12290; </P>
<P>&#29305;&#27530;&#26041;&#27861;&#21487;&#20197;&#30001;&#23376;&#31867;&#25152;&#32487;&#25215;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#29305;&#27530;&#26041;&#27861;&#30340;&#20316;&#29992;&#23601;&#22909;&#27604;&#20854;&#20182;&#38754;&#21521;&#23545;&#35937;&#35821;&#35328;&#20013;&#30340;&#31867;&#26041;&#27861;&#12290;</P>
<P>&#29305;&#27530;&#26041;&#27861;&#23450;&#20041;&#34920;&#36798;&#24335;&#36820;&#22238; nil&#12290;</P>
<H2>&#31867;&#26041;&#27861;&#30340;&#23450;&#20041;</H2>
<P>&#22312; Ruby&#26041;&#27861;&#23601;&#26159;&#25351;&#23450;&#32473;&#19968;&#20010;&#31867;&#30340;&#26041;&#27861;&#12290;&#31867;&#20063;&#26159;&#23545;&#35937;&#65292;&#25152;&#20197;&#20063;&#21487;&#20197;&#20687;&#19968;&#33324;&#23545;&#35937;&#19968;&#26679;&#25351;&#23450;&#26041;&#27861;&#12290;</P>
<P>&#22240;&#27492;&#65292;&#22312;&#31867;&#23545;&#35937;&#24403;&#20013;&#23450;&#20041;&#19968;&#20010;&#26041;&#27861;&#26102;&#65292;&#35813;&#26041;&#27861;&#23601;&#20250;&#25104;&#20026;&#31867;&#26041;&#27861;&#12290;&#20855;&#20307;&#30340;&#23450;&#20041;&#26041;&#27861;&#22914;&#19979;&#65288;&#27169;&#22359;&#20013;&#20134;&#21516;&#65289;&#65306;</P><PRE><FONT face=Verdana># &#29305;&#27530;&#26041;&#27861;&#23450;&#20041;<BR>class Hoge
  def Hoge.foo
  end
end

# &#22312;&#31867;&#23450;&#20041;&#20043;&#22806;&#23450;&#20041;&#20063;&#21487;&#20197;<BR>def Hoge.bar
end

# &#36825;&#26679;&#23450;&#20041;&#30340;&#35805;&#65292;&#26082;&#20351;&#31867;&#21517;&#31216;&#25913;&#21464;&#20063;&#19981;&#29992;&#20462;&#25913;&#26041;&#27861;<BR>class Hoge
  def self.baz
  end
end</FONT></PRE>
<H2>&#23450;&#20041;&#25805;&#20316;</H2>
<H3><A name=L000337><FONT face=Verdana>alias</FONT></A></H3>
<P>&#23454;&#20363;&#65306;</P><PRE><FONT face=Verdana>alias foo bar
alias :foo :bar</FONT></PRE>
<P>&#35821;&#27861;&#65306;</P><PRE><FONT face=Verdana>alias &#26032;&#26041;&#27861;&#21517;&#31216; &#26087;&#26041;&#27861;&#21517;&#31216;<BR></FONT></PRE>
<P>&#20197;&#19978;&#35821;&#27861;&#21487;&#20197;&#32473;&#19968;&#20010;&#26041;&#27861;&#25110;&#20840;&#23616;&#21464;&#37327;&#25351;&#23450;&#20854;&#21035;&#21517;&#12290;&#25351;&#23450;&#30340;&#26041;&#27861;&#21517;&#31216;&#21487;&#20197;&#26159;&#26631;&#35782;&#31526;&#25110; <A 
href="sc_symbol.html">&#31526;&#21495;</A>&nbsp;&#65288;&#19981;&#21487;&#20351;&#29992;&#22914; obj.method 
&#36825;&#26679;&#30340;&#34920;&#36798;&#24335;&#65289;&#12290;&#35843;&#29992;&#26041;&#27861;&#26102;&#19981;&#20250;&#35745;&#31639;&#21035;&#21517;&#30340;&#21442;&#25968;&#34920;&#36798;&#24335;&#12290;</P>
<P>&#20351;&#29992;&#26041;&#27861;&#21035;&#21517;&#26102;&#65292;&#26082;&#20351;&#37325;&#26032;&#23450;&#20041;&#35813;&#26041;&#27861;&#65292;&#35813;&#26041;&#27861;&#30340;&#21407;&#26377;&#23450;&#20041;&#20381;&#28982;&#20250;&#34987;&#20445;&#30041;&#12290;&#24403;&#24819;&#35201;&#25913;&#21464;&#26041;&#27861;&#30340;&#34892;&#20026;&#65292;&#21448;&#35201;&#22312;&#26032;&#23450;&#20041;&#30340;&#26041;&#27861;&#20869;&#20351;&#29992;&#26087;&#23450;&#20041;&#26041;&#27861;&#30340;&#32467;&#26524;&#26102;&#21487;&#20197;&#20351;&#29992;&#12290;</P><PRE><FONT face=Verdana># &#23450;&#20041;&#26041;&#27861; foo<BR>def foo
  "foo"
end

# &#35774;&#32622;&#21035;&#21517;&#65288;&#20445;&#30041;&#26041;&#27861;&#23450;&#20041;&#65289;<BR>alias :_orig_foo :foo

# &#37325;&#26032;&#23450;&#20041; foo &#26041;&#27861;&#65288;&#20351;&#29992;&#20197;&#21069;&#30340;&#23450;&#20041;&#65289;<BR>def foo
  _orig_foo * 2
end

p foo  # =&gt; "foofoo"</FONT></PRE>
<P><CODE><FONT face=Verdana>alias &#34920;&#36798;&#24335;&#36820;&#22238; nil&#12290;</FONT></CODE></P>
<H6></H6></BODY></HTML>
